app/views/events/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = ?  [["event_id", 1]]
---

  <% @event.users.each do |user| %>